# ---------------------------------------------------------------------
# 调用需要的库
# Shen_lib是沈老板写的hog-svm识别函数；else_lib是其他需要库
# ---------------------------------------------------------------------
import Shen_lib
import else_lib

# ---------------------------------------------------------------------
# react函数是一个作出相应的函数，参数kind代表物品的种类，根据不同的种类做出不同的反应
# ---------------------------------------------------------------------


def react(kind):
    if kind == 0:
        print(0)
    elif kind == 1:
        print(1)
    else:
        # balabala
        print(2)


# ---------------------------------------------------------------------
# 定义函数demo，在里面实现需要的功能

# URL：传入目标图片和需要检测的图片地址
    # target_url 是目标图片的地址;
    # pic_url是待检测图片的地址，大概率是摄像头传过来；
    # 两者在demo函数的开始填入

# Shen_function():Shen_lib里面的函数
    # 预计该函数接受目标图片和待检测的图片的地址，返回的是待检测图片中物品的分类

# if选择结构根据识别的结果进行相应的操作
# ---------------------------------------------------------------------

def demo():
    
    target_url = ""
    pic_url = ""
    kind = Shen_function(target_url, pic_url)
    react(kind)


demo()
